meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное",
            "РОФЛ" : "шутка",
            "ЩИЩ" : "одобрение или восторг",
            "КРИПОВЫЙ" : "страшный, пугающий",
            "АГРИТЬСЯ" : "злиться"
            }
print ("Прив)))))")
heh = input("хош понять новомодные словечки???(большими буквами!)")
word = ()
if heh == ("ДА"):
    while True:
        word = input("Введите непонятное слово (большими буквами!): ")
        if word in meme_dict.keys():
            print (meme_dict[word])
        else:
            print ("такого я не знать(((")
else:
    print("чо")
